In [1]:
import numpy as np
import matplotlib.pyplot
import pandas as pd
%matplotlib inline

In [2]:
def generate_plots(data):
    pass

This is just temporary data frame we will use data from the mysql server. We will try to test implementing the most looked up airport

In [3]:
df = {
    'Chicago':[1,2,3,4,5,6,7],
    'NYJFK':[5,6,3,5,4,2,1],
    'LAX':[7,8,5,6,7,8,9]
}
data = pd.DataFrame(df)
data

   Chicago  NYJFK  LAX
0        1      5    7
1        2      6    8
2        3      3    5
3        4      5    6
4        5      4    7
5        6      2    8
6        7      1    9